# 주제: 단체게임(상식게임)
# 인원: 3 ~ 6명
# 규칙
# - 참가인원 정하기
# -- 참가자별 닉네임설정
# - 참가인원 중 최초 게임진행자 무작위 한명 선정
# - 게임문제내기 및 타이머설정
# - 나머지인원들이 해당 문제 타이머 전 입력할 수 있도록 설정
# -- 시간초과 시 인원 무조건 벌칙 수행('술드세요!!!')
# - 게임출제 제외 나머지 인원 전부 입력 완료
# - 문제에 대한 각 인원 별 정답 공개
# - 출제자 정답 공개
# - 키워드가 들어가 있으면 정답 처리
# - 벌칙 수행자 공개
# -- 전부 정답 시 출제자 벌칙수행
# -- 정부 오답 시 출제자 벌칙수행
# -- 한명이라도 정답 맞출 시 출제자 제외 오답자 벌칙 수행
# - 출제자 제외 인원 중 1명 무작위 선정
# - 동일하게 진행
# - 전부진행이 확인 시 인원 중 다시 1명 선정
# - 동일하게 진행
# - 종료입력 전까지 계속 진행
# -------------------------------------------------------------------
