import pandas as pd
import tqdm
DF=pd.read_csv('./sinario.csv')
name_list=['문희', '해미', '준하', '신지', '민용', '순재', '사진사', '교감', '민정', '민호', '윤호',
 '개성댁' '찬성' '승현' '간호사', '경비원' '관리인' '경찰' '여학생' '범', '할머니' '인부1',
 '여자환자', '친구' '러시아남자' '여학생1', '여학생2', '여학생3', '러시아인', '유미',
 '유미아버지', '선생1', '선생2', '러시아남', '유리', '일동', '범이조부', '친구1', '친구2', '학생',
 '배달', '학생1', '이모','친구3', '친구4','택시기사', '점쟁이',
 '증권전문가','김밥아줌마', '약사', '강도', '일당들', '경비', '이형사', '고순경', '유미아빠',
 '계산원', '준하친구','교장', '수리공'
 '양호선생', '소연', '남간호사','고모', '변호사',
 '성호', '아줌마', '주번', '종업원', '중년남자', '유미엄마', '중학생', '중학생엄마',
 '어린민호', '어린윤호','음악선생', '용욱', '이사장',
 '대통령', '의사', '경화', '찬성모','선생3', '주민1', '영철', '아저씨', '친척1'
 '친척2','기자', '여간호사', '대근', '경애', '당고모', '어린순재', '어린문희', '어린경애', '순재모',
 '큰어머니', '큰엄마', '영기엄마',
 '개성댁동생', '점원', '아나운서', 
 '사장부인', '사장', '부인', 
 '유간호사', '윤주', '여자친구1', '여자친구2', '박간호사','박간', '유간','아이', '아이1', '아이2', '소개팅남', '선생님', '엄마', '꼬마',
 '교도관', '보영', '앵커', '김기자', '남학생1', '경찰2', '경찰1', '문수', 
 '시험감독', '과장', '직원1', '직원2', 
 '영민', '정육점', '아줌마1', '여자1', '여자2', '남1', '관리원', '무대감독', '정비원', '수위',
 '창동', '사원', '사원2','영어강사', '유미친구', '여학생4', '여학생5', '박산고짱',
 '요가선생', '무당', '신지친구', '남학생2', '범조부', '배우2',
 '청소부', '김원장', '환자2', 'FD', '분장사', '조감독', '남MC', '여MC', '양의사',
 '버스기사', '청소', '포장주인', '기사', '순재친구', '아줌마2', '민용친구','단원1',
 '남2', '양복2', '부장', '선배', '할아버지2', '할아버지1',
 '아내', '교수', '남친척1', '할아버지', '안내원',
 '수학선생', '민수', '박사', '백선생', '미려', '박선생', '범할', '할1', '박씨' ,'요원1','팀장',
 '간수', '유미부', '요원2','경찰7', '반장', '박피디', '희창', '수경', '범할아버지','장원장',
 '장원장처', '장원처', '친구1처', '처형', '작은동서', '큰동서', '처제', '여직원','영기', '도우미',
 '할머니1', '할머니2', '여배우1', '장수', '택배2','어린민용', '택배기사', '중학생민용', '퀵맨', '랍스터주인',
 '병건', '주차요원', '운전자', '박원장', '문원장', '문원장처', '나스타샤', '박원장처', '구급대원', '웨이터',
 '도우미1', '도우미2', '남동생', '여동생', '남선생', '유미짝꿍', '여선생', '여보', '정수']
info_dict={
    "문희": {"age": "60대", "job": "전업주부"},
    "해미": {"age": "40대", "job": "한의사"},
    "준하": {"age": "40대", "job": "무직"},
    "신지": {"age": "20대", "job": "작곡가"},
    "민용": {"age": "20대", "job": "체육교사"},
    "순재": {"age": "70대", "job": "한방병원 원장"},
    "순재친구": {"age": "70대", "job": "미상"},
    "민용친구": {"age": "20대", "job": "미상"},
    "범할": {"age": "70대", "job": "가족"},
    "대근": {"age": "70대", "job": "미상"},
    "무대감독": {"age": "30대", "job": "무대감독"},
    "영민": {"age": "30대", "job": "공연감독"},
    "박피디": {"age": "30대", "job": "방송 PD"},
    "버스기사": {"age": "50대", "job": "버스기사"},
    "수위": {"age": "50대", "job": "학교 수위"},
    "경찰1": {"age": "30대", "job": "경찰관"},
    "경찰2": {"age": "30대", "job": "경찰관"},
    "경찰7": {"age": "30대", "job": "경찰관"},
    "양복2": {"age": "30대", "job": "양복 입은 남자"},
    "박선생": {"age": "30대", "job": "교사"},
    "백선생": {"age": "30대", "job": "교사"},
    "요가선생": {"age": "30대", "job": "요가 강사"},
    "분장사": {"age": "30대", "job": "분장사"},
    "조감독": {"age": "30대", "job": "드라마 조감독"},
    "여MC": {"age": "30대", "job": "방송 MC"},
    "남MC": {"age": "30대", "job": "방송 MC"},
    "앵커": {"age": "30대", "job": "뉴스 앵커"},
    "김기자": {"age": "30대", "job": "기자"},
    "기자": {"age": "30대", "job": "기자"},
    "양의사": {"age": "40대", "job": "의사"},
    "박사": {"age": "50대", "job": "박사"},
    "박씨": {"age": "50대", "job": "주민"},
    "요원1": {"age": "30대", "job": "비밀 요원"},
    "요원2": {"age": "30대", "job": "비밀 요원"},
    "팀장": {"age": "40대", "job": "팀장"},
    "구급대원": {"age": "30대", "job": "119 대원"},
    "웨이터": {"age": "20대", "job": "웨이터"},
    "민정": {"age": "20대", "job": "영어교사"},
    "민호": {"age": "10대", "job": "고등학생"},
    "박산고짱": {"age": "10대", "job": "고등학생"},
    "윤호": {"age": "10대", "job": "고등학생"},
    "개성댁": {"age": "50대", "job": "가사도우미"},
    "개성댁동생": {"age": "40대", "job": "미상"},
    "찬성": {"age": "10대", "job": "고등학생"},
    "승현": {"age": "10대", "job": "초등학생"},
    "간호사": {"age": "30대", "job": "간호사"},
    "경비원": {"age": "50대", "job": "경비원"},
    "관리인": {"age": "50대", "job": "건물 관리인"},
    "경찰": {"age": "30대", "job": "경찰관"},
    "이형사": {"age": "30대", "job": "경찰관"},
    "고순경": {"age": "20대", "job": "경찰관"},
    "여학생": {"age": "10대", "job": "고등학생"},
    "할머니": {"age": "70대", "job": "가족"},
    "인부1": {"age": "40대", "job": "건설 인부"},
    "여자환자": {"age": "30대", "job": "환자"},
    "유미": {"age": "10대", "job": "고등학생"},
    "유미친구": {"age": "10대", "job": "고등학생"},
    "유미아버지": {"age": "40대", "job": "미상"},
    "유미엄마": {"age": "40대", "job": "가수"},
    "유리": {"age": "10대", "job": "고등학생"},
    "학생": {"age": "10대", "job": "고등학생"},
    "학생1": {"age": "10대", "job": "고등학생"},
    "중학생": {"age": "10대", "job": "중학생"},
    "중학생엄마": {"age": "40대", "job": "주부"},
    "어린민호": {"age": "아동", "job": "아동"},
    "어린윤호": {"age": "아동", "job": "아동"},
    "중학생민용": {"age": "10대", "job": "중학생"},
    "어린민용": {"age": "아동", "job": "아동"},
    "어린순재": {"age": "10대", "job": "중학생"},
    "어린문희": {"age": "10대", "job": "중학생"},
    "어린경애": {"age": "10대", "job": "중학생"},
    "순재모": {"age": "40대", "job": "가족 어르신"},
    "큰어머니": {"age": "70대", "job": "가족 어르신"},
    "큰엄마": {"age": "70대", "job": "가족 어르신"},
    "경애": {"age": "60대", "job": "가족"},
    "당고모": {"age": "60대", "job": "가족"},
    "고모": {"age": "60대", "job": "가족"},
    "친척1": {"age": "50대", "job": "친척"},
    "친척2": {"age": "50대", "job": "친척"},
    "처형": {"age": "50대", "job": "가족"},
    "작은동서": {"age": "40대", "job": "가족"},
    "큰동서": {"age": "50대", "job": "가족"},
    "교장": {"age": "50대", "job": "교장"},
    "찬성모": {"age": "40대", "job": "미상"},
    "영기엄마": {"age": "50대", "job": "주부"},
    "남간호사": {"age": "20대", "job": "간호사"},
    "여간호사": {"age": "20대", "job": "간호사"},
    "박간호사": {"age": "20대", "job": "간호사"},
    "유간호사": {"age": "20대", "job": "간호사"},
    "무당": {"age": "40대", "job": "무당"}
}
df=pd.DataFrame()
for x in info_dict.keys():
    a=DF[DF['인물']==x]
    df=pd.concat([df,a])
# print(DF[DF['인물']==['순재','준하']])

df.reset_index(drop=True,inplace=True)
ageDF=df.copy()
jobDF=df.copy()
ageDF.columns=['나이','대사']
jobDF.columns=['직업','대사']
age_dict={x:y['age'] for x, y in info_dict.items()}
job_dict={x:y['job'] for x, y in info_dict.items()}
jobDF.직업=jobDF.직업.replace(job_dict)
ageDF.나이=ageDF.나이.replace(age_dict)
print(df)
print(ageDF)
print(jobDF)
jobDF.to_csv('job.csv',index=False)
ageDF.to_csv('age.csv',index=False)