# 1
ㄱ='프로그래밍(코딩)'
ㄴ='프로그래밍 언어'
ㄷ='자연어'
ㄹ='기계어'
# 2
ㄱ='힙영역'
ㄴ='스택여역'
ㄷ='데이터(값값)'
ㄹ='주소'
# 3
msg='Happy New Year'
num1=11
num2=3
print(num1,'+',num2,'=',num1+num2)
print('%d + %d = %d'%(num1,num2,num1+num2))
print(f'{num1} + {num2} = {num1+num2}')
msg='오늘은 수요일입니다.\n벌써 일주일에 반이 지났습니다.\n빨리 주말이 오면 좋겠습니다.'
print(msg)
# 4
age=28
# ----------------------------------
year='2000'
mon='12'
date='24'
birth=year+'년'+' '+mon+'월'+' '+date+'일'
# ----------------------------------
msg=input('이름을 입력해주세요:')
msg2=input('이름을 입력해주세요:')
print(f'{msg}({msg2})님 반갑습니다~ ^^')
